Revit 2027 API
FabricationPart.CreateHanger Method
Overload List
Name | Description
CreateHanger(Document, FabricationServiceButton, Int32, ElementId) |  Creates a free placed hanger.
CreateHanger(Document, FabricationServiceButton, ElementId, Connector, Double, Boolean) |  Creates a hanger on the fabrication part.
CreateHanger(Document, FabricationServiceButton, Int32, ElementId, Connector, Double, Boolean) |  Creates a hanger on the fabrication part.
Top
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace